# Выполните следующие действия по работе с git-репозиторием:
# Создайте папку my_project и инициализируйте Git-репозиторий
# Добавьте файл script.py с кодом print("Hello, Git!")
# Зафиксируйте изменения с сообщением "Добавлен скрипт"
# Измените файл, добавив строку print("New feature"), и зафиксируйте изменения
# Просмотрите историю коммитов

#### Пояснение к задаче
# Напишите последовательность git-команд так, как бы вы работали с реальной системой. Каждая команда должна находиться на отдельной строчке.

# mkdir my_project
# cd my_project

# git init
# git add script.py
# git commit -m "Добавлен скрипт"
# git add script.py
# git commit -m "Добавлена новая фича"
# git log
