# Выполните следующие действия по работе с git-репозиторием:
# В репозитории, с которым вы работали в задании 1 этой темы создайте ветку feature
# Добавьте в неё измененный файл script.py и зафиксируйте изменения
# Переключитесь на ветку main и слейте изменения из feature
# Удалите ветку feature

#### Пояснение к задаче
# Напишите последовательность git-команд так, как бы вы работали с реальной системой.
# Каждая команда должна находиться на отдельной строчке.

# git branch feature
# git checkout feature
#### (Тут подразумевается редактирование файла script.py)
# git add script.py
# git commit -m "Добавлена функция test"
# git checkout main
# git merge feature
# git branch -d feature
