# Часть 1 (работа с тренажером)
# Напишите файл Dockerfile для приложения app.py.

# Часть 2 (работа вне тренажера)
# Соберите образ и запустите контейнер.

#### Пояснение к задаче
# Для выполнения Части 1 в тренажере введите содержимое файла Docker (Dockerfile), которое будет автоматически проверено.
# Выполните Часть 2 на компьютере в классе, используя файл, подготовленный во время работы с тренажером. 

# # Используем базовый образ с Python
# FROM python:3.9

# # Копируем файл приложения в контейнер
# COPY app.py .

# # Указываем команду для запуска приложения
# CMD ["python", "app.py"]
