# Задача №4:
# Написать программу проверки введенного пароля (boolean)

password = 'qwerty12345'
password1 = input('Введите пароль: ')
password2 = input('Подтвердите пароль: ')
print(password1 == password2)
print(password == password1)
