# Задача №4:
# primes = [2,3,5,7,11,13,17,19,23,29,31,37,41,43,47,53,59,61,67,71]
# выведите 7-й элемент
# выведите последний элемент списка
# выведите первые 6 элементов списка primes
# выведите сумму минимального и максимального элемента

primes = [2, 3, 5, 7, 11, 13, 17, 19, 23, 29,
          31, 37, 41, 43, 47, 53, 59, 61, 67, 71]

print(primes[6])
print(primes[len(primes)-1])
for i in range(6):
    print(primes[i], end=' ')
print()
print(min(primes) + max(primes))
