# Задача №7:
# Написать программу "Угадай число"

num = 42
if (num == int(input("Введите число: "))):
    print("Угадал!")
else:
    print("Не угадал!")
