# Задача №2:
# Написать программу вычисления площади прямоугольника

a = int(input('Введите длину прямоугольника: '))
b = int(input('Введите ширину прямоугольника: '))
s = a * b
print('Площадь прямоугольника равна: ' + str(s))
